Table of Contents
 Class InternalForcesBuilder<T>.Sections
Namespace
IdeaStatiCa.BimApiLink.Results
Assembly
IdeaStatiCa.BimApiLink.dll
public sealed class InternalForcesBuilder<T>.Sections
Inheritance
object
InternalForcesBuilder<T>.Sections
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Methods
 Add(double, double, double, double, double, double, double)
public InternalForcesBuilder<T>.Sections Add(double position, double n, double qy, double qz, double mx, double my, double mz)
Parameters
position double
n double
qy double
qz double
mx double
my double
mz double
Returns
InternalForcesBuilder<T>.Sections
 Edit this page